[
    {
        "title": "Password Reset Instructions",
        "content": "To reset your password: 1. Go to the login page and click 'Forgot Password'. 2. Enter your email address. 3. Check your email for a reset link. 4. Click the link and enter a new password. 5. Confirm your new password. If you don't receive the email, check your spam folder or contact support.",
        "category": "account",
        "tags": ["password", "reset", "login", "account"],
        "source_type": "FAQ"
    },
    {
        "title": "Billing Cycle and Payment Methods",
        "content": "Our billing cycle runs monthly from the date of signup. We accept major credit cards (Visa, MasterCard, American Express), PayPal, and bank transfers. Payments are processed automatically on your billing date. You can update your payment method in your account settings under 'Billing Information'.",
        "category": "billing",
        "tags": ["billing", "payment", "credit card", "paypal"],
        "source_type": "FAQ"
    },
    {
        "title": "Browser Compatibility Issues",
        "content": "Our platform is optimized for modern browsers. If you're experiencing issues: 1. Clear your browser cache and cookies. 2. Disable browser extensions temporarily. 3. Try using an incognito/private window. 4. Update your browser to the latest version. Supported browsers: Chrome 90+, Firefox 88+, Safari 14+, Edge 90+.",
        "category": "technical",
        "tags": ["browser", "compatibility", "technical", "troubleshooting"],
        "source_type": "troubleshooting"
    },
    {
        "title": "Account Verification Process",
        "content": "New accounts require email verification. After registration: 1. Check your email for a verification message. 2. Click the verification link within 24 hours. 3. Your account will be activated immediately. If you don't receive the email, check spam folders or request a new verification email from your account dashboard.",
        "category": "account",
        "tags": ["verification", "email", "account", "activation"],
        "source_type": "FAQ"
    },
    {
        "title": "Product Feature Overview",
        "content": "Our platform offers: Dashboard Analytics - Real-time data visualization and reporting. Team Collaboration - Share projects and communicate with team members. File Management - Upload, organize, and share files securely. API Integration - Connect with third-party services. Mobile Access - Full functionality on mobile devices.",
        "category": "product",
        "tags": ["features", "dashboard", "collaboration", "api", "mobile"],
        "source_type": "documentation"
    },
    {
        "title": "Data Export and Backup",
        "content": "You can export your data at any time: 1. Go to Settings > Data Export. 2. Select the data types you want to export. 3. Choose your preferred format (CSV, JSON, PDF). 4. Click 'Generate Export'. 5. Download the file when ready. Exports are available for 7 days. We also perform automatic daily backups of all user data.",
        "category": "technical",
        "tags": ["export", "backup", "data", "download"],
        "source_type": "documentation"
    },
    {
        "title": "Subscription Plans and Pricing",
        "content": "We offer three subscription tiers: Basic ($9/month) - Up to 5 users, 10GB storage, email support. Professional ($29/month) - Up to 25 users, 100GB storage, priority support, advanced features. Enterprise ($99/month) - Unlimited users, 1TB storage, dedicated support, custom integrations. Annual plans receive 20% discount.",
        "category": "billing",
        "tags": ["pricing", "subscription", "plans", "billing"],
        "source_type": "pricing"
    },
    {
        "title": "Security and Privacy Settings",
        "content": "Protect your account with these security features: Two-Factor Authentication - Enable in Security Settings. Strong Passwords - Use at least 12 characters with mixed case, numbers, and symbols. Login Monitoring - Review login history in your account. Data Privacy - Control what information is shared in Privacy Settings. Session Management - Log out unused sessions remotely.",
        "category": "account",
        "tags": ["security", "privacy", "2fa", "password", "sessions"],
        "source_type": "security_guide"
    },
    {
        "title": "API Rate Limits and Usage",
        "content": "API usage limits by plan: Basic - 1,000 requests/hour. Professional - 10,000 requests/hour. Enterprise - 100,000 requests/hour. Rate limit headers are included in responses. If you exceed limits, requests will return HTTP 429. Contact support for higher limits. API documentation available at /docs endpoint.",
        "category": "technical",
        "tags": ["api", "rate limits", "usage", "technical"],
        "source_type": "api_documentation"
    },
    {
        "title": "Mobile App Installation and Setup",
        "content": "Download our mobile app: iOS - Available on App Store, requires iOS 13+. Android - Available on Google Play, requires Android 8+. Setup: 1. Download and install the app. 2. Log in with your existing credentials. 3. Enable push notifications for updates. 4. Sync your data automatically. Offline mode available for viewing previously loaded content.",
        "category": "product",
        "tags": ["mobile", "app", "ios", "android", "setup"],
        "source_type": "user_guide"
    },
    {
        "title": "Common Error Messages and Solutions",
        "content": "Frequent error solutions: 'Connection Timeout' - Check internet connection, try again in a few minutes. 'Invalid Credentials' - Verify username/password, reset if needed. 'File Too Large' - Compress file or upgrade plan for larger limits. 'Permission Denied' - Contact admin for access rights. 'Server Error' - Temporary issue, try again or contact support if persistent.",
        "category": "technical",
        "tags": ["errors", "troubleshooting", "solutions", "technical"],
        "source_type": "troubleshooting"
    },
    {
        "title": "Team Management and Permissions",
        "content": "Manage your team effectively: Add Members - Send invitations via email from Team Settings. Role Assignment - Owner, Admin, Member, Viewer roles available. Permission Control - Set project-specific access levels. Activity Monitoring - Track team member activities. Billing Management - Owners and Admins can manage subscriptions and payments.",
        "category": "product",
        "tags": ["team", "permissions", "roles", "management"],
        "source_type": "admin_guide"
    }
] 